


* Basic functions

#+name: basic_functions
#+begin_src lisp :tangle yes
(ql:quickload "cl-ppcre")
(ql:quickload "alexandria")

(defun read-file (infile)
  (with-open-file (instream infile :direction :input :if-does-not-exist nil)
    (when instream 
      (let ((string (make-string (file-length instream))))
        (read-sequence string instream)
        string))))

(defun write-file (string outfile &key (action-if-exists :error))
  (check-type action-if-exists (member nil :error :new-version :rename :rename-and-delete 
					   :overwrite :append :supersede))
  (with-open-file (outstream outfile
			     :direction
			     :output
			     :if-does-not-exist :create
			     :if-exists action-if-exists)
    (write-sequence string outstream)))

(defun range (min max &optional (step 1))
  (when (<= min max)
    (cons min (range (+ min step) max step))))
#+end_src

#+RESULTS: basic_functions
: RANGE


* working with grid

The grid has the following structure:

#+begin_example
Material Structure in 2D
0  0 1 #1 #2 #3 #4 #5 1 0 0 
0  0 1 #1 #2 #3 #4 #5 1 0 0
0  0 1 #1 #2 #3 #4 #5 1 0 0
0  0 1 #1 #2 #3 #4 #5 1 0 0
3  1 1 #1 #2 #3 #4 #5 1 1 4   
3  1 1 #1 #2 #3 #4 #5 1 1 4
3  1 1 #1 #2 #3 #4 #5 1 1 4
0  0 1 #1 #2 #3 #4 #5 1 0 0
0  0 1 #1 #2 #3 #4 #5 1 0 0   
0  0 1 #1 #2 #3 #4 #5 1 0 0
0  0 1 #1 #2 #3 #4 #5 1 0 0 
End
#+end_example

We write it as a org-mode table:


** source table
#+tblname: g0
| 0 | 0 | 1 | 1 | 2 | 3 | 4 | 5 | 1 | 0 | 0 |
| 0 | 0 | 1 | 1 | 2 | 3 | 4 | 5 | 1 | 0 | 0 |
| 0 | 0 | 1 | 1 | 2 | 3 | 4 | 5 | 1 | 0 | 0 |
| 0 | 0 | 1 | 1 | 2 | 3 | 4 | 5 | 1 | 0 | 0 |
| 3 | 1 | 1 | 1 | 2 | 3 | 4 | 5 | 1 | 1 | 4 |
| 3 | 1 | 1 | 1 | 2 | 3 | 4 | 5 | 1 | 1 | 4 |
| 3 | 1 | 1 | 1 | 2 | 3 | 4 | 5 | 1 | 1 | 4 |
| 0 | 0 | 1 | 1 | 2 | 3 | 4 | 5 | 1 | 0 | 0 |
| 0 | 0 | 1 | 1 | 2 | 3 | 4 | 5 | 1 | 0 | 0 |
| 0 | 0 | 1 | 1 | 2 | 3 | 4 | 5 | 1 | 0 | 0 |
| 0 | 0 | 1 | 1 | 2 | 3 | 4 | 5 | 1 | 0 | 0 |
#+TBLFM: @1$1=0

#+name: write_new_grid
#+header: :var g=g0
#+begin_src lisp :tangle yes
(defun show-board (output board)
  (loop for i below (car (array-dimensions board)) do
        (loop for j below (cadr (array-dimensions board)) do
          (let ((cell (aref board i j)))
            (format output "~a " cell)))
        (format output "~%")))

(defun list-to-2d-array (list)
  (make-array (list (length list)
                    (length (first list)))
              :initial-contents list))

(defun 2d-array-to-list (array)
  (loop for i below (array-dimension array 0)
        collect (loop for j below (array-dimension array 1)
                      collect (aref array i j))))

(defun range (max &key (min 0) (step 1))
   (loop for n from min below max by step
      collect n))

(setf garray (list-to-2d-array g))

(defun change_columns (garray column_list value)
  (mapcar #'(lambda (j)
	      (mapcar
	       #'(lambda (i) (setf (aref garray i j) value))
	       (range (cadr (array-dimensions garray)))
	       ))
	  column_list))

(defun return_array (garray i)
  (let ((garray2 (alexandria:copy-array garray)))
    (change_columns garray2 (remove i (range 8 :min 3)) 1)
    (change_columns garray2 (list i) 2 )
    garray2
    ))

(defun get_grid_array (i)
(with-output-to-string (str)
  (show-board str
	      (return_array garray i)
	      )
  str))


(get_grid_array 3)

#+end_src

#+RESULTS: write_new_grid
#+begin_example
0 0 1 2 1 1 1 1 1 0 0 
0 0 1 2 1 1 1 1 1 0 0 
0 0 1 2 1 1 1 1 1 0 0 
0 0 1 2 1 1 1 1 1 0 0 
3 1 1 2 1 1 1 1 1 1 4 
3 1 1 2 1 1 1 1 1 1 4 
3 1 1 2 1 1 1 1 1 1 4 
0 0 1 2 1 1 1 1 1 0 0 
0 0 1 2 1 1 1 1 1 0 0 
0 0 1 2 1 1 1 1 1 0 0 
0 0 1 2 1 1 1 1 1 0 0 
#+end_example


* export grd

#+name: write_new_grff
#+begin_src lisp :tangle yes

(defun get_grid_array (i)
(with-output-to-string (str)
  (show-board str
	      (return_array garray i)
	      )
  str))

(defun replace_grd_string (string pos)
  (cl-ppcre:regex-replace-all
   "structure_variable"
   string
   (get_grid_array pos)
   )
  )

(defun write_grd (infile outfile pos)
  (write-file
   (replace_grd_string (read-file infile) pos)
   outfile :action-if-exists :overwrite)
  )


(mapcar #'(lambda (i) 
	    (write_grd "moving_barrier.grd"
		       (concatenate 'string "m" (write-to-string i) ".grd")
		       i))
	(range 9 :min 2 ))

(range 7 :min 2 )
#+end_src

#+RESULTS: write_new_grff
| 2 | 3 | 4 | 5 | 6 |



* work on sif list


#+name: sif_files
#+begin_src lisp  :tangle yes
(defun sif_variable_list (max min)
  (setf mesh_files (mapcar #'(lambda (i) (concatenate 'string
						      "m"
						      (write-to-string i)))
			 (concatenate 'list
				      (range 9 :min 2 )
				      (reverse (range 8 :min 3 )))
			 ))
  (defun fpor1 (i)  (+ 5 (* i i 0.05)) )
  
  (setf porosity_values
	(mapcar #'(lambda (i) (mapcar #'(lambda (j) (list (fpor1
							   i) j)) mesh_files))  (range 20 :min 00 )))

  (setf (cdr (last mesh_files)) mesh_files)

  (mapcar #'(lambda (i j) (list
			   (concatenate 'string
					"moving_barrier_"
					(format nil "~4,'0D" i)
					".sif")
			   
			   (concatenate 'string
					"mb"
					(format nil "~4,'0D" i)
					".vtu")

			   (fpor1 i)
			   j
			   ))
	  (range max :min min) mesh_files)
  )


(sif_variable_list 10 0)

;mesh_files

#+end_src

#+RESULTS: sif_files
| moving_barrier_0000.sif | mb0000.vtu |  5.0 | m2 |
| moving_barrier_0001.sif | mb0001.vtu | 5.05 | m3 |
| moving_barrier_0002.sif | mb0002.vtu |  5.2 | m4 |
| moving_barrier_0003.sif | mb0003.vtu | 5.45 | m5 |
| moving_barrier_0004.sif | mb0004.vtu |  5.8 | m6 |
| moving_barrier_0005.sif | mb0005.vtu | 6.25 | m7 |
| moving_barrier_0006.sif | mb0006.vtu |  6.8 | m8 |
| moving_barrier_0007.sif | mb0007.vtu | 7.45 | m7 |
| moving_barrier_0008.sif | mb0008.vtu |  8.2 | m6 |
| moving_barrier_0009.sif | mb0009.vtu | 9.05 | m5 |


* Export files


Each file has different porosity


#+name: write_new_sif
#+begin_src lisp :tangle yes

(defun process_string (string &key (grd_directory "m1") (fname "moving_barrier.vtu") (porosity "1.0e4 1.0e4"))
  (setf string1
	(cl-ppcre:regex-replace-all
	 "post_file_variable"
	 string
	 fname))
  (setf string2
	(cl-ppcre:regex-replace-all
	 "porosity_variable"
	 string1
	 porosity))
  (setf string3
	(cl-ppcre:regex-replace-all
	 "grd_directory"
	 string2
	 grd_directory))
  string3
  )


(defun output_sif_files (max min)
  (mapcar #'(lambda (i)
	      (write-file 
	       (process_string
		(read-file "moving_barrier.sif")
		:fname (format nil "~a" (cadr i))
		:porosity (format nil "~f ~f" (caddr i) (cadr i))
		:grd_directory (format nil "~a" (cadddr i))
		)
	       (concatenate 'string "./sif/" (car i))
	       :action-if-exists :overwrite))
	  (sif_variable_list max min)
	  )
  )


(output_sif_files 1000 0)

#+end_src

#+RESULTS: write_new_sif
| Header |


* Call them

#+name: call_them
#+begin_src lisp :tangle yes 

(setf infile (concatenate 'string *ROOT* "moving_barrier.sif"))

(setf SIF-FOLDER (concatenate 'string *ROOT* "/sif/"))

(defmacro fpor1 (i)
  `(+ 10 (* ,i ,i 0.5))
  )

(defmacro fpor2 (i)
  `(+ 10 (* ,i 5))
  )

(write-sif-files-to-folder "moving_barrier"
			   infile
			   SIF-FOLDER
			   (range 200 300)
			   'fpor1)



(mapcar #'(lambda (i)
	    (list (fpor1 i) (fpor2 i)))
	    (range 0 200))
	
#+end_src
